simulation/openfoam/tjunction_3d_mill/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-6;   // coordinates below are micrometres

vertices
(
    (0.0 0.0 0.0)   // 0
    (2000.0 0.0 0.0)   // 1
    (2000.0 400.0 0.0)   // 2
    (0.0 400.0 0.0)   // 3
    (0.0 0.0 200.0)   // 4
    (2000.0 0.0 200.0)   // 5
    (2000.0 400.0 200.0)   // 6
    (0.0 400.0 200.0)   // 7
    (2400.0 0.0 0.0)   // 8
    (2400.0 400.0 0.0)   // 9
    (2400.0 0.0 200.0)   // 10
    (2400.0 400.0 200.0)   // 11
    (6400.0 0.0 0.0)   // 12
    (6400.0 400.0 0.0)   // 13
    (6400.0 0.0 200.0)   // 14
    (6400.0 400.0 200.0)   // 15
    (2400.0 2400.0 0.0)   // 16
    (2000.0 2400.0 0.0)   // 17
    (2400.0 2400.0 200.0)   // 18
    (2000.0 2400.0 200.0)   // 19
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 10) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (20 20 10) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (200 20 10) simpleGrading (1 1 1)
    hex (2 9 16 17 6 11 18 19) (20 100 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oil_inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    water_inlet
    {
        type patch;
        faces
        (
            (17 19 18 16)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 15 14)
        );
    }
    symmetryPlane
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (10 14 15 11)
            (6 11 18 19)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (1 8 10 5)
            (1 2 9 8)
            (8 12 14 10)
            (9 11 15 13)
            (8 9 13 12)
            (2 6 19 17)
            (9 16 18 11)
            (2 17 16 9)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
