simulation/openfoam/tjunction_3d_mill/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // water leg pre-filled down to the junction top (y = 400 um);
    // z spans the whole half-depth domain
    boxToCell
    {
        box (0.002 0.0004 0) (0.0024 0.0024 0.0002);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);

// ************************************************************************* //
